* raw stats
** env notes
- using hog driver ep sessions with po-lift and po-model-lift
- collecting stats from api-0-perf, since api-1-perf is a small box
- 25 workers
- ~ 160 requests per second, but this fatigued to about 120 rps towards the end
** stats without wonko
#+begin_src
==================== API COUNTS

          get_user-token_count: 25141 -----------------------------------   OK     [-lt 1000]
      get_user_token_400_count: 0 ---------------------------------------   OK     [-gt 1000]
         get_user_token_400_pc: 0 ---------------------------------------   OK     [-gt 2]
             get_buckets_count: 25196 -----------------------------------   OK     [-lt 1000]
         get_buckets_404_count: 0 ---------------------------------------   OK     [-gt 1000]
            get_buckets_404_pc: 0 ---------------------------------------   OK     [-gt 2]
          confirm_bucket_count: 22600 -----------------------------------   OK     [-lt 1000]
      confirm_bucket_400_count: 44 --------------------------------------   OK     [-gt 1000]
         confirm_bucket_400_pc: 0 ---------------------------------------   OK     [-gt 2]
                   error_count: 0 ---------------------------------------   OK     [-gt 0]

==================== HISTOGRAMS

GB
          0   20079 / 25198    79.68%  79.68%
         5    2658 / 25198    10.55%  90.23%
        10    1055 / 25198    4.19%  94.42%
        15     594 / 25198    2.36%  96.78%
        20     302 / 25198    1.20%  97.98%
        25     147 / 25198    0.58%  98.56%

                   GB-under-10: 90 -------------------------------------- FAIL     [-lt 97]
GUT
          0   13382 / 25145    53.22%  53.22%
         5    6255 / 25145    24.88%  78.10%
        10    2579 / 25145    10.26%  88.35%
        15    1158 / 25145    4.61%  92.96%
        20     554 / 25145    2.20%  95.16%
        25     311 / 25145    1.24%  96.40%

                  GUT-under-10: 78 -------------------------------------- FAIL     [-lt 90]

==================== STORED PROCS

sessions-by-user-token
          0   22942 / 25199    91.04%  91.04%
         5    1330 / 25199    5.28%  96.32%
        10     478 / 25199    1.90%  98.22%
        15     204 / 25199    0.81%  99.03%
        20     107 / 25199    0.42%  99.45%
        25      47 / 25199    0.19%  99.64%

                 sbut-under-10: 96 -------------------------------------- FAIL     [-lt 99]
partition-by-id


/apps/eccentrica/code/bin/status: line 18: [: too many arguments
                 pbid-under-10: -lt 99 ----------------------------------     OK
                            []:
get-buckets-stored-proc
          0   19084 / 25044    76.20%  76.20%
         5    3588 / 25044    14.33%  90.53%
        10    1173 / 25044    4.68%  95.21%
        15     423 / 25044    1.69%  96.90%
        20     171 / 25044    0.68%  97.58%
        25     101 / 25044    0.40%  97.99%

       gb-stored-proc-under-10: 90 -------------------------------------- FAIL     [-lt 99]
get-user-token-sp
          0   15065 / 25305    59.53%  59.53%
         5    5375 / 25305    21.24%  80.77%
        10    2281 / 25305    9.01%  89.79%
        15     982 / 25305    3.88%  93.67%
        20     483 / 25305    1.91%  95.58%
        25     267 / 25305    1.06%  96.63%

               gut-sp-under-10: 80 -------------------------------------- FAIL     [-lt 99]
#+end_src
** stats with wonko
#+begin_src
==================== API COUNTS

          get_user-token_count: 25178 -----------------------------------   OK     [-lt 1000]
      get_user_token_400_count: 0 ---------------------------------------   OK     [-gt 1000]
         get_user_token_400_pc: 0 ---------------------------------------   OK     [-gt 2]
             get_buckets_count: 25234 -----------------------------------   OK     [-lt 1000]
         get_buckets_404_count: 0 ---------------------------------------   OK     [-gt 1000]
            get_buckets_404_pc: 0 ---------------------------------------   OK     [-gt 2]
          confirm_bucket_count: 14614 -----------------------------------   OK     [-lt 1000]
      confirm_bucket_400_count: 33 --------------------------------------   OK     [-gt 1000]
         confirm_bucket_400_pc: 0 ---------------------------------------   OK     [-gt 2]
                   error_count: 1 --------------------------------------- FAIL     [-gt 0]

==================== HISTOGRAMS

GB
          0   16938 / 25236    67.12%  67.12%
         5    3910 / 25236    15.49%  82.61%
        10    1805 / 25236    7.15%  89.76%
        15     945 / 25236    3.74%  93.51%
        20     544 / 25236    2.16%  95.66%
        25     339 / 25236    1.34%  97.01%

                   GB-under-10: 82 -------------------------------------- FAIL     [-lt 97]
GUT
          0   11182 / 25181    44.41%  44.41%
         5    6846 / 25181    27.19%  71.59%
        10    3202 / 25181    12.72%  84.31%
        15    1492 / 25181    5.93%  90.23%
        20     790 / 25181    3.14%  93.37%
        25     459 / 25181    1.82%  95.19%

                  GUT-under-10: 71 -------------------------------------- FAIL     [-lt 90]

==================== STORED PROCS

sessions-by-user-token
          0   22078 / 25237    87.48%  87.48%
         5    1823 / 25237    7.22%  94.71%
        10     672 / 25237    2.66%  97.37%
        15     313 / 25237    1.24%  98.61%
        20     148 / 25237    0.59%  99.20%
        25      71 / 25237    0.28%  99.48%

                 sbut-under-10: 94 -------------------------------------- FAIL     [-lt 99]
partition-by-id


/apps/eccentrica/code/bin/status: line 18: [: too many arguments
                 pbid-under-10: -lt 99 ----------------------------------     OK
                            []:
get-buckets-stored-proc
          0   18310 / 25077    73.02%  73.02%
         5    3914 / 25077    15.61%  88.62%
        10    1359 / 25077    5.42%  94.04%
        15     553 / 25077    2.21%  96.25%
        20     261 / 25077    1.04%  97.29%
        25     111 / 25077    0.44%  97.73%

       gb-stored-proc-under-10: 88 -------------------------------------- FAIL     [-lt 99]
get-user-token-sp
          0   13769 / 25785    53.40%  53.40%
         5    6041 / 25785    23.43%  76.83%
        10    2728 / 25785    10.58%  87.41%
        15    1273 / 25785    4.94%  92.34%
        20     620 / 25785    2.40%  94.75%
        25     347 / 25785    1.35%  96.09%

               gut-sp-under-10: 76 -------------------------------------- FAIL     [-lt 99]
#+end_src
** other notes
#+begin_src
Exception in thread "Thread-9" java.lang.NullPointerException
        at clj_kafka.new.producer$send.invoke(producer.clj:64)
        at wonko_client.kafka_producer$send.invoke(kafka_producer.clj:38)
        at wonko_client.core$gauge.doInvoke(core.clj:31)
        at clojure.lang.RestFn.invoke(RestFn.java:445)
        at eccentrica.monitoring$register_tuple_stats.invoke(monitoring.clj:61)
        at eccentrica.db.stats$monitor_db_stats.invoke(stats.clj:24)
        at eccentrica.utils.threads$start_daemon$fn__19179.invoke(threads.clj:14)
        at clojure.lang.AFn.run(AFn.java:22)
        at java.lang.Thread.run(Thread.java:745)
#+end_src


* comparison table
| stat          | without wonko | with wonko | % slower |
|---------------+---------------+------------+----------|
| gb call < 5   |            79 |         67 |   -15.19 |
| gb call < 10  |            90 |         82 |    -8.89 |
| gut call < 5  |            53 |         44 |   -16.98 |
| gut call < 10 |            78 |         71 |    -8.97 |
| gb sp < 5     |            76 |         73 |    -3.95 |
| gb sp < 10    |            90 |         88 |    -2.22 |
| gut sp < 5    |            59 |         53 |   -10.17 |
| gut sp < 10   |            80 |         76 |    -5.00 |
#+TBLFM: $4=($3 - $2)*100/$2;%.2f

* conclusions
- EP api calls are about 15% slower at the 10ms mark with wonko
- They don't seem to affect the 5ms level as much
